# NeedTwoPartsToMerge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForMergePartFailures..::..NeedTwoPartsToMerge Property
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class See Also
---
Attempt to merge fewer than two parts. There must be at least two. No part will be produced.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NeedTwoPartsToMerge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NeedTwoPartsToMerge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NeedTwoPartsToMerge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace